# GetDimText

## Description
Function GetDimText returns the dimension value displayed with the referenced object.&lt;BR&gt;
&lt;BR&gt;

```pascal
FUNCTION GetDimText(h : HANDLE) : STRING;
```

```python

def vs.GetDimText(h):
    return STRING
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## Examples
```pascal
DimValue:=GetDimText(HandleToObj);
```

## Version
Availability: from MiniCAD
## Category
* Dimensions